; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	infrared1 - mode
	Star0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation7 - direction
	Star8 - direction
	GroundStation10 - direction
	Star12 - direction
	Star13 - direction
	Star11 - direction
	Star6 - direction
	GroundStation9 - direction
	GroundStation2 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star11)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
)
(:goal (and
	(have_image Phenomenon14 infrared1)
	(have_image Star15 infrared1)
	(have_image Planet16 infrared1)
	(have_image Planet17 thermograph0)
	(have_image Planet18 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation2 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 planet16 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet16)
   goals met: 0 of 5
5. (take_image satellite0 planet16 instrument1 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon14 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon14 instrument1 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 2 of 5
8. (turn_to satellite0 planet17 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet17)
   goals met: 2 of 5
9. (take_image satellite0 planet17 instrument1 thermograph0)
   added: (have_image planet17 thermograph0)
   goals met: 3 of 5
10. (turn_to satellite0 planet18 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet18)
   goals met: 3 of 5
11. (take_image satellite0 planet18 instrument1 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 4 of 5
12. (turn_to satellite0 star15 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star15)
   goals met: 4 of 5
13. (take_image satellite0 star15 instrument1 infrared1)
   added: (have_image star15 infrared1)
   goals met: 5 of 5
